---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.SpatialElement
source: html/6b1d0dc7-2f99-c6d7-c8ab-c7388aebadfd.htm
---
# SpatialElement Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.